# PrimaryHandRailPosition Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RailingType..::..PrimaryHandRailPosition Property
RailingType Class See Also
---
The position of the primary handrail.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public HandRailPosition PrimaryHandRailPosition { get; set; }
```

Visual Basic
---
```text
Public Property PrimaryHandRailPosition As HandRailPosition
	Get
	Set
```

Visual C++
---
```text
public:
property HandRailPosition PrimaryHandRailPosition {
	HandRailPosition get ();
	void set (HandRailPosition value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: The rail has no primary hand rail. |

# See Also
RailingType Class
Autodesk.Revit.DB.Architecture Namespace